# One Hot Encodding ANd get_dummies

In [1]:
import numpy as np 
import pandas as pd

In [2]:
df = pd.read_csv("C:\\Users\\saurabh\\Desktop\\pyth\\cars.csv" , usecols = ['name' , 'km_driven' , 'fuel' , 'owner' , 'selling_price'])

In [3]:
df.head()

,name,selling_price,km_driven,fuel,owner
0,Maruti 800 AC BSII,50000,100000,Petrol,Fourth & Above Owner
1,Maruti Gypsy E MG410W ST,95000,100000,Petrol,Second Owner
2,Mahindra Jeep CL 500 MDI,250000,35000,Diesel,Second Owner
3,Mahindra Jeep MM 540,200000,60000,Diesel,First Owner
4,Mahindra Jeep CL 500 MDI,150000,120000,Diesel,Third Owner

In [4]:
df.isnull().sum()

name             0
selling_price    0
km_driven        0
fuel             0
owner            0
dtype: int64

In [5]:
df['owner'].value_counts()

First Owner             2832
Second Owner            1106
Third Owner              304
Fourth & Above Owner      81
Test Drive Car            17
Name: owner, dtype: int64

# One Hot Encoding using Pandas

In [6]:
pd.get_dummies(df , columns = ['fuel' , 'owner'])

,name,selling_price,km_driven,fuel_CNG,fuel_Diesel,fuel_Electric,fuel_LPG,fuel_Petrol,owner_First Owner,owner_Fourth & Above Owner,owner_Second Owner,owner_Test Drive Car,owner_Third Owner
0,Maruti 800 AC BSII,50000,100000,0,0,0,0,1,0,1,0,0,0
1,Maruti Gypsy E MG410W ST,95000,100000,0,0,0,0,1,0,0,1,0,0
2,Mahindra Jeep CL 500 MDI,250000,35000,0,1,0,0,0,0,0,1,0,0
3,Mahindra Jeep MM 540,200000,60000,0,1,0,0,0,1,0,0,0,0
4,Mahindra Jeep CL 500 MDI,150000,120000,0,1,0,0,0,0,0,0,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...
4335,Hyundai Venue SX Opt Turbo BSIV,1050000,1100,0,0,0,0,1,1,0,0,0,0
4336,Hyundai Grand i10 1.2 Kappa Magna BSIV,545000,5000,0,0,0,0,1,1,0,0,0,0
4337,Ford Figo Aspire 1.5 TDCi Titanium,530000,45000,0,1,0,0,0,1,0,0,0,0
4338,Tata Harrier XE,426000,1000,0,1,0,0,0,1,0,0,0,0
4339,Honda Amaze S Petrol BSIV,614000,1000,0,0,0,0,1,1,0,0,0,0

In [7]:
pd.get_dummies(df , columns = ['fuel' , 'owner'] , drop_first = True)

,name,selling_price,km_driven,fuel_Diesel,fuel_Electric,fuel_LPG,fuel_Petrol,owner_Fourth & Above Owner,owner_Second Owner,owner_Test Drive Car,owner_Third Owner
0,Maruti 800 AC BSII,50000,100000,0,0,0,1,1,0,0,0
1,Maruti Gypsy E MG410W ST,95000,100000,0,0,0,1,0,1,0,0
2,Mahindra Jeep CL 500 MDI,250000,35000,1,0,0,0,0,1,0,0
3,Mahindra Jeep MM 540,200000,60000,1,0,0,0,0,0,0,0
4,Mahindra Jeep CL 500 MDI,150000,120000,1,0,0,0,0,0,0,1
...,...,...,...,...,...,...,...,...,...,...,...
4335,Hyundai Venue SX Opt Turbo BSIV,1050000,1100,0,0,0,1,0,0,0,0
4336,Hyundai Grand i10 1.2 Kappa Magna BSIV,545000,5000,0,0,0,1,0,0,0,0
4337,Ford Figo Aspire 1.5 TDCi Titanium,530000,45000,1,0,0,0,0,0,0,0
4338,Tata Harrier XE,426000,1000,1,0,0,0,0,0,0,0
4339,Honda Amaze S Petrol BSIV,614000,1000,0,0,0,1,0,0,0,0

# Using One Hot Encoding

In [8]:
from sklearn.model_selection import train_test_split

In [10]:
x = df.drop(columns = ['km_driven'] , axis = 1)
y = df['km_driven']

In [11]:
x_train , x_test , y_train , y_test = train_test_split(x,y,test_size = 0.2 , random_state = 42)

In [12]:
x_train.head()

,name,selling_price,fuel,owner
227,Hyundai Santro GS,80000,Petrol,First Owner
964,Tata Indica Vista Aura 1.3 Quadrajet BSIV,250000,Diesel,Second Owner
2045,Maruti SX4 VDI,340000,Diesel,Second Owner
1025,Maruti Swift Dzire VXi,370000,Petrol,Second Owner
4242,Tata Tiago 1.2 Revotron XZ,539000,Petrol,First Owner

In [13]:
from sklearn.preprocessing import OneHotEncoder

In [14]:
ohe = OneHotEncoder(drop = 'first' , sparse = False)

In [15]:
x_train_new = ohe.fit_transform(x_train[['fuel' , 'owner']])

In [16]:
x_train_new

array([[0., 0., 0., ..., 0., 0., 0.],
       [1., 0., 0., ..., 1., 0., 0.],
       [1., 0., 0., ..., 1., 0., 0.],
       ...,
       [1., 0., 0., ..., 0., 0., 0.],
       [1., 0., 0., ..., 0., 0., 0.],
       [1., 0., 0., ..., 1., 0., 0.]])

In [17]:
x_test_new = ohe.fit_transform(x_test[['fuel' , 'owner']])

# Column Transformer

In [26]:
df = pd.read_csv("C:\\Users\\saurabh\\Desktop\\pyth\\covid_toy.csv")

In [27]:
df.head()

   age  gender  fever cough     city has_covid
0   60    Male  103.0  Mild  Kolkata        No
1   27    Male  100.0  Mild    Delhi       Yes
2   42    Male  101.0  Mild    Delhi        No
3   31  Female   98.0  Mild  Kolkata        No
4   65  Female  101.0  Mild   Mumbai        No

In [28]:
df.isnull().sum()

age           0
gender        0
fever        10
cough         0
city          0
has_covid     0
dtype: int64

In [29]:
from sklearn.impute import SimpleImputer # for missing values imputation(filling) 

from sklearn.preprocessing import OneHotEncoder # Category ==> Sub-category ==> column creation 
from sklearn.preprocessing import OrdinalEncoder # Sub-Category ==>Convert into  Numbers

In [30]:
x = df.drop(columns = ['has_covid'])
y = df['has_covid']

In [31]:
from sklearn.model_selection import train_test_split 

x_train , x_test , y_train ,y_test = train_test_split(x,y,test_size=  0.2 , random_state = 42)

# Manually type output

In [32]:
# Adding Simple Imputer to fever column  

si = SimpleImputer() 
x_train_fever = si.fit_transform(x_train[['fever']])

x_test_fever = si.fit_transform(x_test[['fever']])

In [33]:
# x_train

In [37]:
x_train_fever.shape

(80, 1)

# step-2 

Ordinal Encoding ==> Cough

In [47]:
oe = OrdinalEncoder(categories = [[ 'Mild' , 'Strong']])

x_train_cough = oe.fit_transform(x_train[[ 'cough']])

In [48]:
# x_train.head()
x_train_cough.shape

(80, 1)

# step -3    OneHotEncoding ===> Gender , City

In [50]:
ohe = OneHotEncoder(drop = 'first' , sparse = False)
x_train_gender_city = ohe.fit_transform(x_train[['gender' , 'city']])

In [53]:
x_train_gender_city.shape

(80, 4)

# step - 4 (Extracting Age)

In [54]:
x_train_age = x_train.drop(columns = ['gender' , 'fever' , 'cough' , 'city']).values

In [55]:
x_train_age.shape

(80, 1)

# step-5 (Concatenate all the data )

In [56]:
x_train_transformed = np.concatenate((x_train_age , x_train_fever , x_train_gender_city , x_train_cough) , axis = 1)

In [58]:
x_train_transformed.shape

(80, 7)

# We can do this in one cell using Column Transformer

In [59]:
from sklearn.compose import ColumnTransformer

In [60]:
transformer = ColumnTransformer(transformers = [
    ('a' , SimpleImputer() , ['fever']) ,  #Simple Imputer fill your missing values 
    ('b' , OrdinalEncoder(categories = [['Mild' , 'Strong']]) , ['cough']),
    ('c' , OneHotEncoder(sparse = False , drop = 'first') , ['gender' , 'city'])
] , remainder = 'passthrough')   # remainder = 'ppassthrough' ==> means rest all are columns remain constant .

In [62]:
transformer.fit_transform(x_train).shape

(80, 7)